; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v7 ?v5)
             (pred_7 ?v3 ?v8)
             (pred_4 ?v7 ?v8)
             (pred_6 ?v2 ?v7 )
	     (pred_10 ?v7)
             (pred_12 ?v4)
             (pred_8 ?v3)
             (pred_5 ?v8)
             (pred_2 ?v7)
             (pred_9 ?v3)
             (pred_1 ?v7)
             (pred_3 ))



(:action op_2
:parameters (?v10 ?v13 ?v12 ?v1)
:precondition (and (pred_12 ?v10) (pred_12 ?v13) (pred_8 ?v12) (pred_5 ?v1)
          (pred_11 ?v10 ?v13) (pred_7 ?v12 ?v1)
                   (pred_4 ?v13 ?v1) (pred_10 ?v10) 
                   (pred_2 ?v13) (pred_9 ?v12))
:effect (and  (pred_1 ?v13) (not (pred_2 ?v13))))


(:action op_1
:parameters (?v10 ?v9)
:precondition (and (pred_12 ?v10) (pred_12 ?v9)
               (pred_10 ?v10) (pred_11 ?v10 ?v9) (pred_1 ?v9))
:effect (and (pred_10 ?v9) (not (pred_10 ?v10))))

(:action op_3
:parameters (?v10 ?v12)
:precondition (and (pred_12 ?v10) (pred_8 ?v12) 
                  (pred_10 ?v10) (pred_6 ?v12 ?v10) (pred_3 ))
:effect (and (pred_9 ?v12)
   (not (pred_6 ?v12 ?v10)) (not (pred_3 ))))


(:action op_4
:parameters (?v10 ?v11 ?v6)
:precondition (and (pred_12 ?v10) (pred_8 ?v11) (pred_8 ?v6)
                  (pred_10 ?v10) (pred_9 ?v6) (pred_6 ?v11 ?v10))
:effect (and (pred_9 ?v11) (pred_6 ?v6 ?v10)
        (not (pred_9 ?v6)) (not (pred_6 ?v11 ?v10))))

(:action op_5
:parameters (?v10 ?v12)
:precondition (and (pred_12 ?v10) (pred_8 ?v12) 
                  (pred_10 ?v10) (pred_9 ?v12))
:effect (and (pred_3 ) (pred_6 ?v12 ?v10) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_15 obj_26 obj_10 obj_31 obj_21 obj_23 obj_06 obj_25 obj_16 obj_17 obj_22 obj_02 obj_04 obj_11 obj_19 obj_03 obj_24 obj_07 obj_20 obj_05 obj_08 obj_29 obj_01 obj_30
    obj_12 obj_28 obj_18
    obj_14 obj_09 obj_13
    )

    (:init
       (pred_3)

       (pred_12 obj_27)
       (pred_12 obj_15)
       (pred_12 obj_26)
       (pred_12 obj_10)
       (pred_12 obj_31)
       (pred_12 obj_21)
       (pred_12 obj_23)
       (pred_12 obj_06)
       (pred_12 obj_25)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_22)
       (pred_12 obj_02)
       (pred_12 obj_04)
       (pred_12 obj_11)
       (pred_12 obj_19)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_07)
       (pred_12 obj_20)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_01)
       (pred_12 obj_30)
       (pred_5 obj_12)
       (pred_5 obj_28)
       (pred_5 obj_18)
       (pred_8 obj_14)
       (pred_8 obj_09)
       (pred_8 obj_13)

       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_15)
       (pred_11 obj_15 obj_23)
       (pred_11 obj_15 obj_26)
       (pred_11 obj_15 obj_27)
       (pred_11 obj_26 obj_06)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_10 obj_25)
       (pred_11 obj_10 obj_31)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_31 obj_16)
       (pred_11 obj_31 obj_10)
       (pred_11 obj_21 obj_17)
       (pred_11 obj_21 obj_23)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_23 obj_22)
       (pred_11 obj_23 obj_06)
       (pred_11 obj_23 obj_15)
       (pred_11 obj_23 obj_21)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_06 obj_25)
       (pred_11 obj_06 obj_26)
       (pred_11 obj_06 obj_23)
       (pred_11 obj_25 obj_04)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_10)
       (pred_11 obj_25 obj_06)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_16 obj_31)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_17 obj_19)
       (pred_11 obj_17 obj_22)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_22 obj_03)
       (pred_11 obj_22 obj_02)
       (pred_11 obj_22 obj_23)
       (pred_11 obj_22 obj_17)
       (pred_11 obj_02 obj_24)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_02 obj_22)
       (pred_11 obj_04 obj_07)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_04 obj_25)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_11 obj_20)
       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_04)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_03)
       (pred_11 obj_19 obj_17)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_24)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_03 obj_19)
       (pred_11 obj_24 obj_29)
       (pred_11 obj_24 obj_07)
       (pred_11 obj_24 obj_02)
       (pred_11 obj_24 obj_03)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_07 obj_24)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_20 obj_11)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_08 obj_29)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_29 obj_24)
       (pred_11 obj_29 obj_08)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_4  obj_16 obj_12)
       (pred_4  obj_02 obj_28)
       (pred_4  obj_15 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_26)
       (pred_1 obj_10)
       (pred_1 obj_31)
       (pred_1 obj_21)
       (pred_1 obj_23)
       (pred_1 obj_06)
       (pred_1 obj_25)
       (pred_1 obj_17)
       (pred_1 obj_22)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_03)
       (pred_1 obj_24)
       (pred_1 obj_07)
       (pred_1 obj_20)
       (pred_1 obj_05)
       (pred_1 obj_08)
       (pred_1 obj_29)
       (pred_1 obj_01)
       (pred_1 obj_30)

       (pred_7  obj_14 obj_12)
       (pred_7  obj_09 obj_28)
       (pred_7  obj_13 obj_18)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_09 obj_27)
       (pred_6 obj_13 obj_03)
       (pred_10 obj_11)
    )

    (:goal (and
       (pred_6 obj_14 obj_29)
       (pred_6 obj_13 obj_07)
    ))
(:constraints
  (always (not (pred_10 obj_24)))
)
)

; plan
1. (op_1 obj_11 obj_04)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_07)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_07)
   goals met: 0 of 2
3. (op_1 obj_07 obj_01)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_01)
   goals met: 0 of 2
4. (op_3 obj_01 obj_14)
   deleted: (pred_6 obj_14 obj_01) (pred_3)
   added: (pred_9 obj_14)
   goals met: 0 of 2
5. (op_1 obj_01 obj_29)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_29)
   goals met: 0 of 2
6. (op_5 obj_29 obj_14)
   deleted: (pred_9 obj_14)
   added: (pred_3) (pred_6 obj_14 obj_29)
   goals met: 1 of 2
7. (op_1 obj_29 obj_08)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_08)
   goals met: 1 of 2
8. (op_1 obj_08 obj_03)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_03)
   goals met: 1 of 2
9. (op_3 obj_03 obj_13)
   deleted: (pred_6 obj_13 obj_03) (pred_3)
   added: (pred_9 obj_13)
   goals met: 1 of 2
10. (op_1 obj_03 obj_08)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_08)
   goals met: 1 of 2
11. (op_1 obj_08 obj_29)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_29)
   goals met: 1 of 2
12. (op_1 obj_29 obj_01)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_01)
   goals met: 1 of 2
13. (op_1 obj_01 obj_07)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_07)
   goals met: 1 of 2
14. (op_5 obj_07 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_3) (pred_6 obj_13 obj_07)
   goals met: 2 of 2
